<script lang="ts" setup></script>

<template>
    <div class="__terms">
        <div class="space-y-4 p-8">
            <div>
                <h2 class="text-xl font-semibold text-blue-500">
                    1. Сбор данных
                </h2>
                <p>
                    Мы собираем абсолютно все данные о вас: от паспортных данных
                    до любимого вкуса мороженого. Мы также оставляем за собой
                    право слушать ваши телефонные звонки, читать сообщения и
                    подглядывать в ваши окна, если это потребуется.
                </p>
            </div>
            <div>
                <h2 class="text-xl font-semibold text-blue-500">
                    2. Использование данных
                </h2>
                <p>
                    Все собранные данные передаются третьим сторонам: соседям,
                    бабушке на лавочке у подъезда, вашей бывшей и всем
                    заинтересованным. Мы также можем продать ваши данные на
                    чёрном рынке в рамках наших «маркетинговых акций».
                </p>
            </div>
            <div>
                <h2 class="text-xl font-semibold text-blue-500">
                    3. Безопасность данных
                </h2>
                <p>
                    Мы гарантируем, что ваши данные будут защищены... от вас
                    самих. Поэтому доступ к личному кабинету будет предоставлен
                    только за отдельную плату, размер которой определяется нами
                    ежедневно.
                </p>
            </div>
            <div>
                <h2 class="text-xl font-semibold text-blue-500">
                    4. Передача данных за рубеж
                </h2>
                <p>
                    Мы отправляем ваши данные в самые экзотические страны, где
                    никакие законы о конфиденциальности не действуют. В
                    особенности они пользуются популярностью в офшорных зонах и
                    в офисах хакеров.
                </p>
            </div>
            <div>
                <h2 class="text-xl font-semibold text-blue-500">
                    5. Срок хранения данных
                </h2>
                <p>
                    Ваши данные хранятся вечно. Даже если вы решите удалить
                    аккаунт, мы будем продолжать использовать и распространять
                    информацию. Удалить можно только за существенную плату в
                    натуральных алмазах.
                </p>
            </div>
            <div>
                <h2 class="text-xl font-semibold text-blue-500">
                    6. Изменение Политики
                </h2>
                <p>
                    Мы можем изменять эту Политику в любое время и без
                    уведомления. Просто знайте: с каждым новым изменением мы
                    будем знать о вас чуть больше.
                </p>
            </div>
            <div>
                <h2 class="text-xl font-semibold text-blue-500">
                    7. Ответственность Пользователя
                </h2>
                <p>
                    Пользователь обязан самостоятельно следить за тем, чтобы
                    Компания не упустила ничего важного о его жизни.
                    Своевременное обновление данных о месте жительства, зарплате
                    и статусе отношений является обязательным.
                </p>
            </div>
            <div>
                <h2 class="text-xl font-semibold text-blue-500">
                    8. Заключительные положения
                </h2>
                <p>
                    Настоящая Политика разработана в полном соответствии с вашим
                    чувством юмора. Все несогласные будут лично заблокированы на
                    уровне DNS-серверов.
                </p>
            </div>
        </div>
        <p class="text-gray-600 text-sm mt-6 text-center">
            С любовью,
            <span class="text-red-500 font-semibold"
                >Ваша любимая Компания</span
            >
        </p>
    </div>
</template>

<style lang="scss" scoped></style>
